<?php

/* @var $this yii\web\View */

use yii\helpers\Html;

$this->title = 'Про нас';
?>
<div class="site-about">
  <section class="container-fluid">
    <div class="container">
      <div class="row text-center header-alert">
        <div class="col-sm-12">
          <?= Html::img('@web/img/about.png'); ?>
          <h2>Інформація про нас</h2>
        </div>
      </div>
      <div class="row">
        <div class="col-12 author">
          <h3 class="text-center fio_author">Давиденко Євген Олександрович</h3>
          <?= Html::img('@web/img/authors/Davidenko.png', ['class' => 'about_photo']); ?>
          <div class="about_description">
            <p><b>Посада:</b><br/>
              доцент (б.в.з.) кафедри інженерії програмного забезпечення, к.т.н.
            </p>
            <p><b>Досягнення:</b><br>
              <ul type="square">
                <li>2016 р. – нагороджений почесною грамотою Департаменту освіти і науки Миколаївської облдержадміністрації.</li>
                <li>2016 р. – нагороджений дипломом Департаменту освіти і науки Миколаївської облдержадміністрації, ради ректорів вищих навчальних закладів Миколаївської області.</li>
                <li>2017 р. – переможець обласного конкурсу наукових робіт молодих учених Миколаївської області в номінації «Технічні науки».</li>
              </ul>
            </p>
            <p><b>Роль в проекті:</b><br>
              <ul type="square">
                <li>Автор ідеї проекту.</li>
                <li>Керівник магістерської наукової роботи.</li>
              </ul>
            </p>
          </div>
        </div>

        <div class="col-12 author">
          <h3 class="text-center fio_author">Федорик Микола Михайлович</h3>
          <?= Html::img('@web/img/authors/Fedorik.jpg', ['class' => 'about_photo']); ?>
          <div class="about_description">
            <p><b>Основні відомості:</b><br>
              <ul type="square">
                <li>2012 р. – вступ до ЧДУ ім.Петра Могили на факультет комп'ютерних наук.</li>
                <li>2012-2016 рр. – студент факультету комп'ютерних наук ЧДУ ім.Петра Могили (бакалаврат).</li>
                <li>2016 р. – вступ до ЧНУ ім.Петра Могили на магістратуру.</li>
                <li>2016-2018 рр. – студент факультету комп'ютерних наук ЧНУ ім.Петра Могили за спеціальність "Системний аналіз" (магістратура).</li>
                <li>2018 р. - участь у конференції (Всеукраїнська науково-практична конференція молодих вчених, аспірантів і студентів "Інтелектуальні інформаційні системи", випуск з ЧНУ ім.Петра Могили, отримання диплому.</li>
              </ul>
            </p>
            <p><b>Роль в проекті:</b><br>
              <ul type="square">
                <li>Співавтор ідеї проекту.</li>
                <li>Аналіз сучасного стану дистанційної освіти.</li>
                <li>Розробник web-орієнтованої платформи для дистанційної освіти (серверна частина).</li>
              </ul>
            </p>
          </div>
        </div>

        <div class="col-12 author">
          <h3 class="text-center fio_author">Чернологов Іван Іванович</h3>
          <?= Html::img('@web/img/authors/Chernolohov.jpg', ['class' => 'about_photo']); ?>
          <div class="about_description">
            <p><b>Основні відомості:</b><br>
              <ul type="square">
                <li>2012 р. – вступ до ЧДУ ім.Петра Могили на факультет комп'ютерних наук.</li>
                <li>2012-2016 рр. – студент факультету комп'ютерних наук ЧДУ ім.Петра Могили (бакалаврат).</li>
                <li>2016 р. – вступ до ЧНУ ім.Петра Могили на магістратуру.</li>
                <li>2016-2018 рр. – студент факультету комп'ютерних наук ЧНУ ім.Петра Могили за спеціальність "Системний аналіз" (магістратура).</li>
                <li>2018 р. - участь у конференції (Всеукраїнська науково-практична конференція молодих вчених, аспірантів і студентів "Інтелектуальні інформаційні системи", випуск з ЧНУ ім.Петра Могили, отримання диплому.</li>
              </ul>
            </p>
            <p><b>Роль в проекті:</b><br>
              <ul type="square">
                <li>Співавтор ідеї проекту.</li>
                <li>Аналіз сучасного стану дистанційної освіти.</li>
                <li>Розробник web-орієнтованої платформи для дистанційної освіти (серверна частина).</li>
              </ul>
            </p>
          </div>
        </div>

      </div>
    </div>
  </section>
</div>
